//=============================================================================
// ■ kernel.c
//-----------------------------------------------------------------------------
//   这个文件是干什么的？
//=============================================================================

#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>

#define GRAPHICS_WIDTH 320
#define GRAPHICS_HEIGHT 200
enum color {
	C_BLACK = 0,
	C_MAROON,
	C_GREEN,
	C_OLIVE,
	C_NAVY,
	C_PURPLE,
	C_TEAL,
	C_SILVER,
	C_GRAY,
	C_RED,
	C_LIME,
	C_YELLOW,
	C_BLUE,
	C_FUCHSIA,
	C_AQUA,
	C_WHITE
};

//---------------------------------------------------------------------------
// ● 根据地址写入内存
//---------------------------------------------------------------------------
void write_memory(int address, char value) {
	*((char*) address) = value;
}

//---------------------------------------------------------------------------
// ● 取得像素在内存中的位置
//---------------------------------------------------------------------------
int point(int x, int y) {
	return 0xa0000 + x + y * GRAPHICS_WIDTH;
}

//---------------------------------------------------------------------------
// ● 绘制单个像素点
//---------------------------------------------------------------------------
void set_pixel(int x, int y, enum color color) {
	write_memory(point(x, y), color);
}

//---------------------------------------------------------------------------
// ● 绘制矩形
//---------------------------------------------------------------------------
void draw_rect(int x, int y, int width, int height, enum color color) {
	int cx, cy;
	for (cy = y; cy < y + height; cy++) {
		for (cx = x; cx < x + width; cx++) {
			set_pixel(cx, cy, color);
		}
	}
}

//---------------------------------------------------------------------------
// ● 主程序
//---------------------------------------------------------------------------
void kernel_main() {
	draw_rect(16, 16, 16, 16, C_GREEN);
}
