//=============================================================================
// ■ kernel.c
//-----------------------------------------------------------------------------
//   这个文件是干什么的？
//=============================================================================

#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>

#define GRAPHICS_WIDTH 320
#define GRAPHICS_HEIGHT 200
enum color {
	C_BLACK = 0,
	C_MAROON,
	C_GREEN,
	C_OLIVE,
	C_NAVY,
	C_PURPLE,
	C_TEAL,
	C_SILVER,
	C_GRAY,
	C_RED,
	C_LIME,
	C_YELLOW,
	C_BLUE,
	C_FUCHSIA,
	C_AQUA,
	C_WHITE
};

//---------------------------------------------------------------------------
// ● 根据地址写入内存
//---------------------------------------------------------------------------
void write_memory(int address, char value) {
	*((char*) address) = value;
}

//---------------------------------------------------------------------------
// ● 主程序
//---------------------------------------------------------------------------
void kernel_main() {
	int i;
	for (i = 0xa0000; i < 0xaffff; i++) {
		write_memory(i, i & 0xff);
	}
}
